#include <iostream>
#include <cmath>

using namespace std;

// Если задача требует от нас принять решение - выполнить то или иное, то следует воспользоваться конструкцией if-else
// if (true) { *** } - если bool выражение в скобках истинно, то выполни код в скобках
// else { *** } - иначе выполни другой код

	/* Как получить логическое значение (bool) ?
	* 1) Операции сравнения
	* 1.1) Равенство: ПЕРВОЕ == ВТОРОЕ. Eсли ПЕРВОЕ равно ВТОРОМУ, истина (true)
	* 1.2) Отрицание: ПЕРВОЕ != ВТОРОЕ. Eсли ПЕРВОЕ не равно ВТОРОМУ, истина (true)
	*
	* 1.3) Больше, чем: ПЕРВОЕ > ВТОРОЕ.
	* 1.4) Больше или равно: ПЕРВОЕ >= ВТОРОЕ
	*
	* 1.5) Меньше, чем: ПЕРВОЕ < ВТОРОЕ.
	* 1.6) Меньше или равно: ПЕРВОЕ <= ВТОРОЕ
	*
	* 2) Логические операции
	* 2.1) Отрицание: !ЛОЖЬ == ИСТИНА = истина
	* 
	* 2.2) И (конъюнкция, логическое умножение) - если хотя бы одно ложно, то всё выражение ложно
	* A && B - оба должны быть истиной
	* 
	* 2.3) ИЛИ (дизъюнкция, логическое сложение) - если хотя бы одно истинно, то всё выражение истинно
	* A || B - одно из двух должно быть истиной
	* 
	* 2.4) XOR (исключающее «или») - если одно истина, а второе - ложь, то истина
	* A ^ B */

/// <summary>
/// Пример работы с if-else.
/// </summary>
/// <description>
/// Определяет возрастную группу пользователя
/// </description>
/// <param name="age">Возраст пользователя</param>
void DefineAge(int age)
{
	if (age < 13) // Если возраст меньше тринадцати
	{
		// То выводим первый вариант
		cout << "Child" << endl;
	}
	else if (age == 13 || age < 20) // Если человеку тринадцать ИЛИ меньше 20
	{
		// То выводим второй вариант
		cout << "Teenager" << endl;
	}
	else // Иначе
	{
		// Выводим последний вариант
		cout << "Adult" << endl;
	}
}

/* Данную конструкцию не рекомендуется использовать, если выборов для решения больше трёх.
Для оптимизации выбора между большими вариантами советую использовать конструкцию switch.
В примере выше код идёт от одного пункта к другому по очереди. Если в очереди if-else будет больше трёх блоков,
то код начнёт терять в скорости выполнения. switch сразу направляет к блоку, который требуется выполнить, игнорируя остальные */
 
/// <summary>
/// Пример работы с конструкцией switch
/// </summary>
void GetRoscomnadzorStatus(int site) // где int site - номер сайта в списке
{
	// Объявляем переключатель, который зависит от целочисленной переменной site
	switch (site)
	{
	case 0:
		break; // Если пользователь напишет 0, программа закроется
	case 1: // Instagram:
		cout << "Инстаграм заблокирован в России с 14 марта 2022 года" << endl;
		break;
	case 2: // Facebook:
		cout << "Facebook заблокирован в России с 4 марта 2022 года." << endl;
		break;
	case 3: // WhatsApp:
		cout << "С августа 2025 года Роскомнадзор заблокировал голосовые и видеозвонки в мессенджере WhatsApp" << endl;
		break;
	case 4: // Telegram:
		cout << "Ограничения Telegram в России вводятся с лета 2025 года" << endl;
		break;
	case 5: // YouTube:
		cout << "Реализация ограничений YouTube началась 1 августа 2024 года" << endl;
		break;
	case 6: // Steam:
		cout << "Steam работает" << endl;
		break;
	case 7: // VK:
		cout << "VK работает" << endl;
		break;
	case 8: // Rutube:
		cout << "Rutube работает" << endl;
		break;

	// Данный блок обрабатывает любое не предусмотренное нами значение
	default:
		cout << "Не располагаю такой информацией" << endl;
		break;
	}
}

/* В случае, если требуется вызывать код определённое (т.е. мы ТОЧНО знаем, сколько итераций) количество раз, следует
воспользоваться конструкцией цикла for */

/// <summary>
/// Пример работы с конструкцией цикла for - выводит таблицу со степенями двоек
/// </summary>
void PrintBinaryTable()
{
	for (int counter = 0; counter < 16; counter++)
	{
		// функция pow из библиотеки cmath возводит число в указанную степень
		cout << "Два в степени " << counter << " = " << pow(2, counter) << endl;
	}
}

/* В случае, если мы не знаем, сколько раз будет выполняться алгоритм, следует прибегнуть к конструкции while */
int main()
{
	setlocale(LC_ALL, "");

	cout << "Age definition output Example:" << endl;
	DefineAge(7);
	DefineAge(15);
	DefineAge(67);
	cout << endl;

	cout << "Binary pow Example:" << endl;
	PrintBinaryTable();
	cout << endl;

	// Пример работы с циклом while
	// Данный цикл позволяет продолжать запрашивать информацию без необходимости перезапускать программу,
	// пока пользователь сам не захочет её прервать (мы не знаем, что ему вздумается)
	int site = 0;
	cout << "ROSCOMNADOR example:" << endl;
	cout << "Чтобы получить информацию о доступности сервиса, введите его номер в списке." << endl;
	cout << "1)  Instagram" << endl;
	cout << "2)  Facebook" << endl;
	cout << "3)  WhatsApp" << endl;
	cout << "4)  Telegram" << endl;
	cout << "5)  YouTube" << endl;
	cout << "6)  Steam" << endl;
	cout << "7)  VK" << endl;
	cout << "8)  Rutube" << endl;
	cout << "Чтобы завершить программу, нажмите 0" << endl;

	// У цикла while 2 формы записи:
	// do-while обеспечивает, что цикл будет выполнен как минимум один раз
	// while предполагает, что цикл может быть не выполнен ни разу
	
	// Пример do-while:
	do // Вначале выполняется код в блоке do
	{
		cout << "Введите номер:" << endl;
		cin >> site;
		GetRoscomnadzorStatus(site);
	} while (site != 0); // Затем мы проверяем, соответствует ли условие истине

	// Пример while:
	while (site != 0)	// Вначале проверка
	{   // и мы никогда не попадаем в этот блок, потому что, из-за того, что вначале выполняется проверка, 
		// site всегда равен нулю и у нас нет возможности перезаписать site на пользовательское значение
		cout << "Введите номер:" << endl;
		cin >> site;
		GetRoscomnadzorStatus(site);
	}
	/* Подходя к реализации цикла, держите в уме, какой из двух вариантов будет более корректным для вашей задачи. */
}
